In [5]:
import pandas as pd

required libraries

In [6]:
import numpy as np

In [7]:
df = pd.read_csv("datasets.csv")

In [8]:
print(df.head())

          datasetName                                            about  \
0  Microbiome Project                American Gut (Microbiome Project)
1               GloBI               Global Biotic Interactions (GloBI)
2      Global Climate                   Global Climate Data Since 1929
3     CommonCraw 2012              3.5B Web Pages from CommonCraw 2012
4   Indiana Webclicks  53.5B Web clicks of 100K users in Indiana Univ.

                                                link       categoryName  \
0            https://github.com/biocore/American-Gut            Biology
1  https://github.com/jhpoelen/eol-globi-data/wik...            Biology
2                     http://en.tutiempo.net/climate    Climate/Weather
3  http://www.bigdatanews.com/profiles/blogs/big-...  Computer Networks
4  http://cnets.indiana.edu/groups/nan/webtraffic...  Computer Networks

    cloud  vintage
0  GitHub      NaN
1  GitHub      NaN
2     NaN   1929.0
3     NaN   2012.0
4     NaN      NaN

In [9]:
print(df.tail())

       datasetName                                          about  \
56  ClueWeb12 FACC                                 ClueWeb12 FACC
57   Google Ngrams                    Google Books Ngrams (2.2TB)
58      EDRM Enron    EDRM Enron EMail of 151 users, hosted on S3
59         GetGlue                GetGlue - users rating TV shows
60  Twitter RepLab  Twitter Data for Online Reputation Management

                                                 link      categoryName  \
56           http://lemurproject.org/clueweb12/FACC1/  Natural Language
57  https://aws.amazon.com/datasets/google-books-n...  Natural Language
58  https://aws.amazon.com/datasets/enron-email-data/   Social Networks
59  http://getglue-data.s3.amazonaws.com/getglue_s...   Social Networks
60                     http://nlp.uned.es/replab2013/   Social Networks

     cloud  vintage
56     NaN   2012.0
57  Amazon      NaN
58  Amazon      NaN
59     NaN      NaN
60     NaN   2013.0

datatypes and info of dataset

In [11]:
df.dtypes

datasetName      object
about            object
link             object
categoryName     object
cloud            object
vintage         float64
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   datasetName   61 non-null     object
 1   about         61 non-null     object
 2   link          61 non-null     object
 3   categoryName  61 non-null     object
 4   cloud         24 non-null     object
 5   vintage       31 non-null     float64
dtypes: float64(1), object(5)
memory usage: 3.0+ KB

In [33]:
df = pd.read_csv("datasets.csv")

Dropping a column

In [ ]:
df = df.drop(['datasetName'],axis=1)

In [35]:
df.head()

,about,link,categoryName,cloud,vintage
0,American Gut (Microbiome Project),https://github.com/biocore/American-Gut,Biology,GitHub,NaN
1,Global Biotic Interactions (GloBI),https://github.com/jhpoelen/eol-globi-data/wik...,Biology,GitHub,NaN
2,Global Climate Data Since 1929,http://en.tutiempo.net/climate,Climate/Weather,NaN,1929.0
3,3.5B Web Pages from CommonCraw 2012,http://www.bigdatanews.com/profiles/blogs/big-...,Computer Networks,NaN,2012.0
4,53.5B Web clicks of 100K users in Indiana Univ.,http://cnets.indiana.edu/groups/nan/webtraffic...,Computer Networks,NaN,NaN

In [36]:
df.describe()

           vintage
count    31.000000
mean   2000.677419
std      24.436840
min    1920.000000
25%    2006.500000
50%    2009.000000
75%    2012.000000
max    2016.000000

df.describe() is an statistical method
while df.info() is a descriptive method

reanming a column

In [37]:
df = pd.read_csv("datasets.csv")

In [40]:
df=df.rename(columns={'datasetName':'Name'})

In [41]:
df.head()

,Name,about,link,categoryName,cloud,vintage
0,Microbiome Project,American Gut (Microbiome Project),https://github.com/biocore/American-Gut,Biology,GitHub,NaN
1,GloBI,Global Biotic Interactions (GloBI),https://github.com/jhpoelen/eol-globi-data/wik...,Biology,GitHub,NaN
2,Global Climate,Global Climate Data Since 1929,http://en.tutiempo.net/climate,Climate/Weather,NaN,1929.0
3,CommonCraw 2012,3.5B Web Pages from CommonCraw 2012,http://www.bigdatanews.com/profiles/blogs/big-...,Computer Networks,NaN,2012.0
4,Indiana Webclicks,53.5B Web clicks of 100K users in Indiana Univ.,http://cnets.indiana.edu/groups/nan/webtraffic...,Computer Networks,NaN,NaN

In [43]:
df.shape

(61, 6)

duplicate vlues

In [54]:
duplicate_rows_df=df(df.duplicates())
print("duplicate values",duplicate_rows_df)

AttributeError: 'DataFrame' object has no attribute 'duplicates'

In [50]:
df=df.drop_duplicates()

In [52]:
df.head()

,Name,about,link,categoryName,cloud,vintage
0,Microbiome Project,American Gut (Microbiome Project),https://github.com/biocore/American-Gut,Biology,GitHub,NaN
1,GloBI,Global Biotic Interactions (GloBI),https://github.com/jhpoelen/eol-globi-data/wik...,Biology,GitHub,NaN
2,Global Climate,Global Climate Data Since 1929,http://en.tutiempo.net/climate,Climate/Weather,NaN,1929.0
3,CommonCraw 2012,3.5B Web Pages from CommonCraw 2012,http://www.bigdatanews.com/profiles/blogs/big-...,Computer Networks,NaN,2012.0
4,Indiana Webclicks,53.5B Web clicks of 100K users in Indiana Univ.,http://cnets.indiana.edu/groups/nan/webtraffic...,Computer Networks,NaN,NaN

In [53]:
print(df.isnull().sum())

Name             0
about            0
link             0
categoryName     0
cloud           37
vintage         30
dtype: int64

dropna drops all missing values

In [58]:
df.dropna()

,Name,about,link,categoryName,cloud,vintage
32,FBI Hate Crime 2013,FBI Hate Crime 2013 - aggregated data,https://github.com/emorisse/FBI-Hate-Crime-Sta...,Social Sciences,GitHub,2013.0
41,NYC Uber,NYC Uber trip data April 2014 to September 2014,https://github.com/fivethirtyeight/uber-tlc-fo...,Transportation,GitHub,2014.0

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 32 to 41
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          2 non-null      object
 1   about         2 non-null      object
 2   link          2 non-null      object
 3   categoryName  2 non-null      object
 4   cloud         2 non-null      object
 5   vintage       2 non-null      float64
dtypes: float64(1), object(5)
memory usage: 112.0+ bytes

In [57]:
df.describe()

           vintage
count     2.000000
mean   2013.500000
std       0.707107
min    2013.000000
25%    2013.250000
50%    2013.500000
75%    2013.750000
max    2014.000000

ASSIGNMENT 4 : test against any random dataset.csv

In [59]:
df = pd.read_csv("country.csv")

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      248 non-null    object
 1   value   249 non-null    object
dtypes: object(2)
memory usage: 4.0+ KB

In [61]:
df.describe()

         id        value
count   248          249
unique  248          249
top      AF  Afiganistaŋ
freq      1            1

In [62]:
df.dropna()

     id          value
0    AF    Afiganistaŋ
1    AX  Åland Islands
2    AL        Alibani
3    DE        Alimaɲi
4    DZ        Alizeri
..   ..            ...
244  NZ  Zelandi Koura
245  GE        Zeyɔrzi
246  GI    Zibralitari
247  ZW      Zimbabuwe
248  JO        Zɔrdani

[248 rows x 2 columns]

In [63]:
df.head()

   id          value
0  AF    Afiganistaŋ
1  AX  Åland Islands
2  AL        Alibani
3  DE        Alimaɲi
4  DZ        Alizeri

In [64]:
df.tail()

     id          value
244  NZ  Zelandi Koura
245  GE        Zeyɔrzi
246  GI    Zibralitari
247  ZW      Zimbabuwe
248  JO        Zɔrdani

In [65]:
df.shape

(249, 2)

In [68]:
df.dtypes

id       object
value    object
dtype: object

In [69]:
df=df.rename(columns={'value':'Name'})

In [70]:
df.head()

   id           Name
0  AF    Afiganistaŋ
1  AX  Åland Islands
2  AL        Alibani
3  DE        Alimaɲi
4  DZ        Alizeri

In [71]:
print(df.isnull().sum())

id      1
Name    0
dtype: int64